import sqlite3


db_path = r'C:\\Users\\youji\OneDrive\\project_facerecognition\\project_facerecognition\\facerecognition\\university.db'
def insert_attendance_data():
    conn = sqlite3.connect(db_path)
    cursor = conn.cursor()
    
    # 데이터 삽입
    attendance_data = [
        # '21018018'
        ('21018018', 1, '2024-10-17', '출석'),
        ('21018018', 1, '2024-10-24', '출석'),
        ('21018018', 1, '2024-10-31', '출석'),
        ('21018018', 1, '2024-11-07', '출석'),
        
        # '21018017'
        ('21018017', 1, '2024-10-17', '출석'),
        ('21018017', 1, '2024-10-24', '출석'),
        ('21018017', 1, '2024-10-31', '출석'),
        ('21018017', 1, '2024-11-07', '출석'),

        # '21018004'
        ('21018004', 1, '2024-10-17', '출석'),
        ('21018004', 1, '2024-10-24', '출석'),
        ('21018004', 1, '2024-10-31', '출석'),
        ('21018004', 1, '2024-11-07', '출석'),

        # '21018049'
        ('21018049', 1, '2024-10-17', '출석'),
        ('21018049', 1, '2024-10-24', '출석'),
        ('21018049', 1, '2024-10-31', '출석'),
        ('21018049', 1, '2024-11-07', '출석'),

        # '21018022'
        ('21018022', 1, '2024-10-17', '출석'),
        ('21018022', 1, '2024-10-24', '출석'),
        ('21018022', 1, '2024-10-31', '출석'),
        ('21018022', 1, '2024-11-07', '출석'),
    ]

    
    cursor.executemany('''
        INSERT INTO attendance (student_id, class_id, attendance_date, status)
        VALUES (?, ?, ?, ?)
    ''', attendance_data)
    
    conn.commit()
    conn.close()


insert_attendance_data()